#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
module.cloudfront_certificate.aws_acm_certificate.app: Refreshing state... [id=arn:aws:acm:us-east-1:836049003243:certificate/9349e804-ccac-4bb7-858e-ac3c70a030bb]
module.cloudfront_waf.aws_wafv2_web_acl.web_acl: Refreshing state... [id=16e83ae8-c426-479b-88d2-87981054f779]
module.cdn.aws_cloudfront_origin_access_identity.origin_access_identity: Refreshing state... [id=E8S34Z9KEPEC4]
data.aws_route53_zone.domain_zone: Reading...
module.website_bucket.aws_kms_key.website_key: Refreshing state... [id=eb0dddca-a798-4c1f-836e-fa99b838705f]
module.website_bucket.aws_s3_bucket.website: Refreshing state... [id=mulla.au]
module.acm_certificate.aws_acm_certificate.app: Refreshing state... [id=arn:aws:acm:ap-southeast-2:836049003243:certificate/74aec104-22f7-4808-b573-cd500ff78973]
data.aws_route53_zone.domain_zone: Read complete after 0s [id=Z019756110G25DTYU8A62]
module.dns.aws_route53_record.www: Refreshing state... [id=Z019756110G25DTYU8A62_www_CNAME]
module.cloudfront_certificate.aws_route53_record.app["*.mulla.au"]: Refreshing state... [id=Z019756110G25DTYU8A62__59998f89be3aecbef1a8f900beeb9d7d.mulla.au._CNAME]
module.cloudfront_certificate.aws_route53_record.app["api.mulla.au"]: Refreshing state... [id=Z019756110G25DTYU8A62__a54e3b575b8c64afeaa561b04feeb168.api.mulla.au._CNAME]
module.cloudfront_certificate.aws_route53_record.app["mulla.au"]: Refreshing state... [id=Z019756110G25DTYU8A62__59998f89be3aecbef1a8f900beeb9d7d.mulla.au._CNAME]
module.cloudfront_certificate.aws_acm_certificate_validation.app: Refreshing state... [id=2023-03-31 18:25:03.135 +0000 UTC]
module.acm_certificate.aws_route53_record.app["mulla.au"]: Refreshing state... [id=Z019756110G25DTYU8A62__59998f89be3aecbef1a8f900beeb9d7d.mulla.au._CNAME]
module.acm_certificate.aws_route53_record.app["*.mulla.au"]: Refreshing state... [id=Z019756110G25DTYU8A62__59998f89be3aecbef1a8f900beeb9d7d.mulla.au._CNAME]
module.acm_certificate.aws_route53_record.app["api.mulla.au"]: Refreshing state... [id=Z019756110G25DTYU8A62__a54e3b575b8c64afeaa561b04feeb168.api.mulla.au._CNAME]
module.acm_certificate.aws_acm_certificate_validation.app: Refreshing state... [id=2023-03-31 18:19:41.308 +0000 UTC]
module.website_bucket.aws_s3_bucket_server_side_encryption_configuration.website_encryption: Refreshing state... [id=mulla.au]
module.policies.data.aws_iam_policy_document.website_policy: Reading...
module.website_bucket.aws_s3_bucket_versioning.website_versioning: Refreshing state... [id=mulla.au]
module.website_bucket.aws_s3_bucket_public_access_block.website_block: Refreshing state... [id=mulla.au]
module.website_bucket.aws_s3_bucket_website_configuration.website_configuration: Refreshing state... [id=mulla.au]
module.website_bucket.aws_s3_bucket_acl.website_acl: Refreshing state... [id=mulla.au,private]
module.policies.data.aws_iam_policy_document.website_policy: Read complete after 0s [id=449611941]
module.website_bucket.aws_s3_bucket_cors_configuration.cors: Refreshing state... [id=mulla.au]
module.cdn.aws_cloudfront_distribution.s3_distribution: Refreshing state... [id=E20M6J2FMJFGTJ]
module.policies.aws_s3_bucket_policy.allow_access_from_another_account: Refreshing state... [id=mulla.au]
module.dns.aws_route53_record.ipv4: Refreshing state... [id=Z019756110G25DTYU8A62_mulla.au_A]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.website_bucket.aws_s3_object.static_files["asset-manifest.json"] will be created
  + resource "aws_s3_object" "static_files" {
      + acl                    = "private"
      + bucket                 = "mulla.au"
      + bucket_key_enabled     = (known after apply)
      + content_type           = "application/json"
      + etag                   = "9f623505d6371c5f694699e70ffb7841"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "asset-manifest.json"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "../webapp/build/asset-manifest.json"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # module.website_bucket.aws_s3_object.static_files["favicon.ico"] will be created
  + resource "aws_s3_object" "static_files" {
      + acl                    = "private"
      + bucket                 = "mulla.au"
      + bucket_key_enabled     = (known after apply)
      + content_type           = "image/vnd.microsoft.icon"
      + etag                   = "76990ec31d42ef49cba761613233de69"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "favicon.ico"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "../webapp/build/favicon.ico"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # module.website_bucket.aws_s3_object.static_files["index.html"] will be created
  + resource "aws_s3_object" "static_files" {
      + acl                    = "private"
      + bucket                 = "mulla.au"
      + bucket_key_enabled     = (known after apply)
      + content_type           = "text/html; charset=utf-8"
      + etag                   = "c13b5bfad96e7853e836e2c380c9e9bd"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "index.html"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "../webapp/build/index.html"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # module.website_bucket.aws_s3_object.static_files["logo192.jpeg"] will be created
  + resource "aws_s3_object" "static_files" {
      + acl                    = "private"
      + bucket                 = "mulla.au"
      + bucket_key_enabled     = (known after apply)
      + content_type           = "image/jpeg"
      + etag                   = "06458f9e11ef95f1cef387a26abe41a1"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "logo192.jpeg"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "../webapp/build/logo192.jpeg"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # module.website_bucket.aws_s3_object.static_files["manifest.json"] will be created
  + resource "aws_s3_object" "static_files" {
      + acl                    = "private"
      + bucket                 = "mulla.au"
      + bucket_key_enabled     = (known after apply)
      + content_type           = "application/json"
      + etag                   = "c2c3d071a8a648cb97d5ca7a9472274c"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "manifest.json"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "../webapp/build/manifest.json"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # module.website_bucket.aws_s3_object.static_files["robots.txt"] will be created
  + resource "aws_s3_object" "static_files" {
      + acl                    = "private"
      + bucket                 = "mulla.au"
      + bucket_key_enabled     = (known after apply)
      + content_type           = "text/plain; charset=utf-8"
      + etag                   = "fa1ded1ed7c11438a9b0385b1e112850"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "robots.txt"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "../webapp/build/robots.txt"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # module.website_bucket.aws_s3_object.static_files["static/css/main.c6ca2323.css"] will be created
  + resource "aws_s3_object" "static_files" {
      + acl                    = "private"
      + bucket                 = "mulla.au"
      + bucket_key_enabled     = (known after apply)
      + content_type           = "text/css; charset=utf-8"
      + etag                   = "15f9d68deadac6e1180839b28e15f256"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "static/css/main.c6ca2323.css"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "../webapp/build/static/css/main.c6ca2323.css"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # module.website_bucket.aws_s3_object.static_files["static/css/main.c6ca2323.css.map"] will be created
  + resource "aws_s3_object" "static_files" {
      + acl                    = "private"
      + bucket                 = "mulla.au"
      + bucket_key_enabled     = (known after apply)
      + content_type           = "application/octet-stream"
      + etag                   = "cd46df77ad174c6d0381123211bd7094"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "static/css/main.c6ca2323.css.map"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "../webapp/build/static/css/main.c6ca2323.css.map"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # module.website_bucket.aws_s3_object.static_files["static/js/787.994511a4.chunk.js"] will be created
  + resource "aws_s3_object" "static_files" {
      + acl                    = "private"
      + bucket                 = "mulla.au"
      + bucket_key_enabled     = (known after apply)
      + content_type           = "application/javascript"
      + etag                   = "8f2d5a2084c5fdc46d8fc36ef81a6dd9"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "static/js/787.994511a4.chunk.js"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "../webapp/build/static/js/787.994511a4.chunk.js"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # module.website_bucket.aws_s3_object.static_files["static/js/787.994511a4.chunk.js.map"] will be created
  + resource "aws_s3_object" "static_files" {
      + acl                    = "private"
      + bucket                 = "mulla.au"
      + bucket_key_enabled     = (known after apply)
      + content_type           = "application/octet-stream"
      + etag                   = "f8c5eaf8681c13b46759d87da0d7e5bc"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "static/js/787.994511a4.chunk.js.map"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "../webapp/build/static/js/787.994511a4.chunk.js.map"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # module.website_bucket.aws_s3_object.static_files["static/js/main.94ba8272.js"] will be created
  + resource "aws_s3_object" "static_files" {
      + acl                    = "private"
      + bucket                 = "mulla.au"
      + bucket_key_enabled     = (known after apply)
      + content_type           = "application/javascript"
      + etag                   = "0428e816dc7fa16b17cc1304703e1346"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "static/js/main.94ba8272.js"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "../webapp/build/static/js/main.94ba8272.js"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # module.website_bucket.aws_s3_object.static_files["static/js/main.94ba8272.js.LICENSE.txt"] will be created
  + resource "aws_s3_object" "static_files" {
      + acl                    = "private"
      + bucket                 = "mulla.au"
      + bucket_key_enabled     = (known after apply)
      + content_type           = "text/plain; charset=utf-8"
      + etag                   = "b114cc85da504a772f040e3f40f8e46a"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "static/js/main.94ba8272.js.LICENSE.txt"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "../webapp/build/static/js/main.94ba8272.js.LICENSE.txt"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # module.website_bucket.aws_s3_object.static_files["static/js/main.94ba8272.js.map"] will be created
  + resource "aws_s3_object" "static_files" {
      + acl                    = "private"
      + bucket                 = "mulla.au"
      + bucket_key_enabled     = (known after apply)
      + content_type           = "application/octet-stream"
      + etag                   = "508eae80c4189d1c76578caa7cef715d"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "static/js/main.94ba8272.js.map"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "../webapp/build/static/js/main.94ba8272.js.map"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

Plan: 13 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @tarekmulla, Action: `pull_request`, Workflow: `Terraform Plan`*